Rewrite README.md. Apply Poetry, Bruno. Chore: fix docker run
